In [ ]:
#DICTIONARY

In [11]:
#creating a dictionary

marks = {'history':45, 'maths':22, 'science':44}

In [12]:
marks

{'history': 45, 'maths': 22, 'science': 44}

In [13]:
#accessing dictionary
marks['history']

45

In [14]:
#adding 1 element in dictionary
marks['english'] = 65

In [15]:
marks

{'history': 45, 'maths': 22, 'science': 44, 'english': 65}

In [16]:
#adding multiple elements in dictionary
marks.update({'Chem':33, 'Bio':45})

In [17]:
marks

{'history': 45,
 'maths': 22,
 'science': 44,
 'english': 65,
 'Chem': 33,
 'Bio': 45}

In [18]:
#deleting from dictionary

del marks['maths']

In [19]:
marks

{'history': 45, 'science': 44, 'english': 65, 'Chem': 33, 'Bio': 45}

In [20]:
import pandas as pd

In [22]:
df = pd.read_csv("C://Users/Neelam/Downloads/data/data.csv")

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
df.shape

(891, 12)

In [26]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
df["PassengerId"]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [30]:
df[["PassengerId","Survived"]]

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]